starintel/20221219011944-why_star_intel.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-07-12 Wed 22:27 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Why Star Intel</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/static/org.css" />
</head>
<body>
<div id="preamble" class="status">
<nav class="navbar">
  <div class="navbar-mode-line">
    <a href="/" class="navbar-circle">◉</a>
    <a href="/programming" class="navbar-filename">Programming</a>
    <a href="/hacking" class="navbar-filename">Hacking</a>
    <a href="/Tutorial" class="navbar-filename">Tutorials</a>
    <a href="/posts.html" class="navbar-filename">All Posts</a>
    <a href="/rss.xml" class="navbar-filename">Rss Feed</a>
  </div>
</nav>
</div>
<div id="content" class="content">
<h1 class="title">Why Star Intel</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orga170860">Why Star intel?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="starintel">starintel</span></span></a>
<ul>
<li><a href="#org2b36c14">Nots for me (REMOVE before publish!)</a>
<ul>
<li><a href="#org11a5e48">Object Type</a></li>
</ul>
</li>
<li><a href="#orgd05eb26">Introduction</a></li>
<li><a href="#org34378dc"><span class="todo TODO">TODO</span> Objectives of this document</a></li>
<li><a href="#org58814c1"><span class="todo TODO">TODO</span> History of Star intel</a>
<ul>
<li><a href="#org76c5be8">Brief overview of the project before it (UNGI)</a></li>
<li><a href="#orgd9ea430">History Of UNGI</a></li>
</ul>
</li>
<li><a href="#orgb7fa47f"><span class="todo TODO">TODO</span> The Theory Behind the Project</a></li>
<li><a href="#org8e9786e"><span class="todo TODO">TODO</span> Implementation Details</a></li>
<li><a href="#orgf41a4ef"><span class="todo TODO">TODO</span> Plug and play artecture</a></li>
<li><a href="#orgfe68754"><span class="todo TODO">TODO</span> Use cases Real world needs</a></li>
<li><a href="#org226fc02"><span class="todo TODO">TODO</span> Conclusion</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orga170860" class="outline-2">
<h2 id="orga170860">Why Star intel?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="starintel">starintel</span></span></h2>
<div class="outline-text-2" id="text-orga170860">
</div>
<div id="outline-container-org2b36c14" class="outline-3">
<h3 id="org2b36c14">Nots for me (REMOVE before publish!)</h3>
<div class="outline-text-3" id="text-org2b36c14">
<p>
outline for objects
</p>
</div>

<div id="outline-container-org11a5e48" class="outline-4">
<h4 id="org11a5e48">Object Type</h4>
<div class="outline-text-4" id="text-org11a5e48">
</div>
<ul class="org-ul">
<li><a id="org2f7c8c1"></a>Definition and purpose of the object type<br /></li>
<li><a id="orge1101ff"></a>Key characteristics or features of the object type<br /></li>
<li><a id="org2fa0138"></a>Examples of how the object type is used in the project<br /></li>
<li><a id="org8bf5ca1"></a>Any special considerations or limitations related to the object type<br /></li>
</ul>
</div>
</div>


<div id="outline-container-orgd05eb26" class="outline-3">
<h3 id="orgd05eb26">Introduction</h3>
<div class="outline-text-3" id="text-orgd05eb26">
<p>
Star Intel (short for "Star Intelligence") is a framework for collecting, storing, and acting on data in near real time. At the core of this framework is a document specification that provides a uniform interface for tools and components to flow.
</p>

<p>
Star Intel is intended to be extensible and cohesive, with a focus on automation. Data is collected by bots and scrapers, which get their configuration from the database. The configuration format is specified in the document specification and will be expanded on later. The core project is not tied to the bots, and the bots are not tied to the project. This "plug and play" design allows for many different tools and components to be easily fit together into a single system.
</p>

<p>
The project is still in the early stages of development, but progress has been made in the past year. The purpose of this document is to provide an overview, including the goals, reasons for creating it, and technical details. I will also discuss the potential applications of the project as well as future directions.
</p>
</div>
</div>


<div id="outline-container-org34378dc" class="outline-3">
<h3 id="org34378dc"><span class="todo TODO">TODO</span> Objectives of this document</h3>
<div class="outline-text-3" id="text-org34378dc">
<p>
This document seeks to explain, expose and help educatue you on my project.
Im going to list each Section and a very small summery about it.
</p>

<p>
The following Sections are:
</p>

<ul class="org-ul">
<li>A history of the project and what came before it</li>
<li>The problems of that project</li>
<li>The theory behind Star Intel</li>
<li>How OSINT/data mining works with current methods</li>
<li>Limitations and why data needs to be uniformly accessed</li>
<li>Introduction to the plug-and-play architecture</li>
<li>Why I chose CouchDB as the main choice for the database</li>
<li>Process for porting the document specification to other languages</li>
<li>Technical Details</li>
<li>Use cases and potential applications.</li>
</ul>
</div>
</div>
<div id="outline-container-org58814c1" class="outline-3">
<h3 id="org58814c1"><span class="todo TODO">TODO</span> History of Star intel</h3>
<div class="outline-text-3" id="text-org58814c1">
</div>
<div id="outline-container-org76c5be8" class="outline-4">
<h4 id="org76c5be8">Brief overview of the project before it (UNGI)</h4>
<div class="outline-text-4" id="text-org76c5be8">
<ul class="org-ul">
<li>Development of UNGI</li>
<li>Description of the original project and its purpose</li>

<li>Development of UNGI</li>

<li>Technical details of the project, including the tools and technologies used</li>

<li>Challenges and limitations faced during the development of UNGI</li>

<li>Evolution of UNGI into Star Intel</li>
</ul>
</div>
</div>

<div id="outline-container-orgd9ea430" class="outline-4">
<h4 id="orgd9ea430">History Of UNGI</h4>
<div class="outline-text-4" id="text-orgd9ea430">
<p>
Ungi Was a set of scripts, bots and at the center Elasticsearch
UNGI was built out of a need to gain
</p>
</div>
</div>
</div>
<div id="outline-container-orgb7fa47f" class="outline-3">
<h3 id="orgb7fa47f"><span class="todo TODO">TODO</span> The Theory Behind the Project</h3>
<div class="outline-text-3" id="text-orgb7fa47f">
<ul class="org-ul">
<li>Why it is important to define the format of a JSON document</li>
<li>Current methods for collecting data at scale in OSINT</li>
<li>Limitations of these methods and the need for a new approach</li>
<li>Introduction to the plug-and-play architecture</li>
<li>Explanation of the choice to use CouchDB</li>
<li>Process for porting the document specification to other languages</li>
</ul>
</div>
</div>

<div id="outline-container-org8e9786e" class="outline-3">
<h3 id="org8e9786e"><span class="todo TODO">TODO</span> Implementation Details</h3>
<div class="outline-text-3" id="text-org8e9786e">
<ul class="org-ul">
<li>Overview of the technical design</li>
<li>Description of the database structure and schema</li>
<li>Explanation of the data ingestion and processing pipeline</li>
<li>Description of the APIs and other interfaces available to users</li>
</ul>
</div>
</div>
<div id="outline-container-orgf41a4ef" class="outline-3">
<h3 id="orgf41a4ef"><span class="todo TODO">TODO</span> Plug and play artecture</h3>
</div>
<div id="outline-container-orgfe68754" class="outline-3">
<h3 id="orgfe68754"><span class="todo TODO">TODO</span> Use cases Real world needs</h3>
</div>
<div id="outline-container-org226fc02" class="outline-3">
<h3 id="org226fc02"><span class="todo TODO">TODO</span> Conclusion</h3>
<div class="outline-text-3" id="text-org226fc02">
<ul class="org-ul">
<li>Summary of the main points covered in the documentation</li>
<li>Discussion of the potential applications and benefits of the project</li>
<li>Future work and directions for development</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author:  (<a href="mailto:unseen@flake">unseen@flake</a>)</p>
<p class="date">Date: </p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 28.2 (<a href="https://orgmode.org">Org</a> mode 9.5.5)</p>
<p class="validation"></p>
</div>
</body>
</html>
